tap "homebrew/cask-fonts"

brew "bat"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "gotags"
brew "hugo"
brew "neovim"
brew "newsboat"
brew "pinentry"
brew "ripgrep"
brew "rust-analyzer"
brew "stow"
brew "tmux"
brew "universal-ctags/universal-ctags/universal-ctags"
brew "vim"
brew "xwmx/taps/nb"

cask "alacritty"
cask "alloy"
cask "calibre"
cask "font-hack-nerd-font"
cask "keepassxc"
cask "skim"
cask "tla-plus-toolbox"
