is_arm = Hardware::CPU.arm?

tap "dwarvesf/tap"
tap "fairwindsops/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "instrumenta/instrumenta"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
tap "universal-ctags/universal-ctags"
tap "versent/taps"
tap "xwmx/taps"
tap "yt-dlp/taps"

brew "adr-tools"
brew "argocd"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "bat"
brew "cmake"
brew "comby"
brew "coreutils"
brew "dasel"
brew "editorconfig"
brew "elan-init"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gdb"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-bug", args: ["HEAD"]
brew "git-delta"
brew "gitleaks"
brew "gnu-tar"
brew "gnupg"
brew "graphviz"
brew "grep"
brew "helm"
brew "htop"
brew "hugo"
brew "hyperfine"
brew "iam-policy-json-to-terraform"
brew "imagemagick"
brew "infracost"
brew "insect"
brew "ipcalc"
brew "jq"
brew "k6"
brew "k9s"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "kubernetes-cli"
brew "libmypaint"
brew "libpcap"
brew "libusb"
brew "libyaml"
brew "linkerd"
brew "llvm"
brew "lsof", link: true
brew "lux"
brew "markdownlint-cli"
brew "mathlibtools"
brew "navi"
brew "nb"
brew "neovim"
brew "newsboat"
brew "nmap"
brew "nvm"
brew "octant"
brew "openssl"
brew "openvpn"
brew "p7zip"
brew "pandoc"
brew "postgresql@14"
brew "pre-commit"
brew "python"
brew "qemu"
brew "r"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "siege"
brew "spotify-tui"
brew "stow"
brew "stress"
brew "tcl-tk"
brew "teamookla/speedtest/speedtest"
brew "telnet"
brew "tfenv"
brew "tfsec"
brew "tig"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "saml2aws"
brew "vim"
brew "watch"
brew "wget"
brew "wifi-password"
brew "yq"
brew "yt-dlp/taps/yt-dlp"

cask "alacritty"
cask "alloy"
cask "authy"
cask "aws-vpn-client"
cask "calibre"
cask "digikam"
cask "discord"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gephi"
cask "hammerspoon"
cask "keepassxc"
cask "mactex"
cask "racket"
cask "sage"
cask "skim"
cask "slack"
cask "spotify"
cask "telegram"
cask "tla-plus-toolbox"
cask "vagrant"
cask "vimmotion"
cask "vlc"
cask "wireshark"
cask "xquartz"
cask "zoom"
cask "zotero"
unless is_arm
  cask "virtualbox"
end
